---
kind: method
id: M:Autodesk.Revit.UI.FileDialog.Show
zh: 取消隐藏、显示
source: html/95d81e22-81ac-0ba2-0e63-112697f4098a.htm
---
# Autodesk.Revit.UI.FileDialog.Show Method

**中文**: 取消隐藏、显示

Shows the dialog using the stored settings.

## Syntax (C#)
```csharp
public ItemSelectionDialogResult Show()
```

## Returns
A status indicating whether the user selected a file name or cancelled the dialog without making a selection.